#множини
data = {'Vlad', 'Bob', 'John', 6, True}         #якщо немає ключів то це вже множина а множина це тобі коли все перемішано 

data2 = {'Vlad', 'Bob', 'John', 6, True, True, True}        #тут теж множина і теж буде виводитися в перемішку але буде один тру просто

#data = [0]          # не можливо змінити бо в можинах немає індексів і юуде видавати помилку
#print(data[0]       #так теж не можна бо теж немає індексів
print(data)

data.pop()          #видаляє останній елемент 
data.clear()        #очищає всю множину 