#множини set
data = {'Vlad', 'Bob', 'John', 6, True}         #якщо немає ключів то це вже множина а множина це тобі коли все перемішано 

data2 = {'Vlad', 'Bob', 'John', 6, True, True, True}        #тут теж множина і теж буде виводитися в перемішку але буде один тру просто

#data = [0]          # не можливо змінити бо в можинах немає індексів і юуде видавати помилку
#print(data[0]       #так теж не можна бо теж немає індексів
print(data)

data.pop()          #видаляє останній елемент 
data.add(5)         #додає в множину 5 тобто якийсь елемент
data.update([4, 6, 'Vlad'])        #теж додає в множину просто зразу типу декілька елементів 
data.remove(6)          #видаляє якийсь елемент 6 наприклад


print(data)
data.clear()        #очищає всю множину 
print(data)


#example

nums = [2, 5, 5, 7]
res = set(nums)              #перетворюю з масиву в множину за домопогою set
print(res)
word = 'Hello'
print(set(word))

#множинна frozenset - це як проста множина але ми нічого не можемо там додавати і міняти ніякі функції там не працюють

froz = frozenset([3, 4.54, 'true', False, 3])
print(froz)