#робота з файлами 

file = open('data/myfile.txt', 'w+')               #якзо немає файлу пітон сам автоматично його створить(ну якщо в другому артументі буде ше +, наприклад w+, але всерівно воно може створити тільки файл але не папку папку треба створювати в ручну), перший параметр це шлях до папки а другий параметр це режим відкриття файлу в цьому випадку w щоб записати в нього якусь інформацію

file.write("Hello world")
file.write('!!!')




file.close()

file2 = open('data/myfile2.txt', 'w+')        #параметр w видаляє все що попердньо було у файлі і записує все заново типу як оновлює, а параметр 'a' не видаляє а продовжує тобто записує далі а не оновляє

file2.write("Hello world")
file2.write('!!!')
file2.write('!!!')




file2.close()

#створимо програму

data = input('Hobby: ')

file3 = open('data/mefile3.txt', 'w+')
file3.write(data)
