#робота з текстом ??????

word = list('Hi Vlad')
word[0] = 'h'

print(word)           # перетворення в список але з символів
print(len(word))        #скільки елементів у спискку(ті ж самі фунцкії як у масивах (списках))
print(word.count('a'))    #скільки а в масиві
print(word.append('a'))  #додати в кінці а

result = ','.join(word)  #Обєднює все що є в списку і вставляє між ними те що у ''. Наприклад ,

print(result.upper())   #всі символи з великикі типу капсом

print(result.lower())   #всі символи з маленької

print(result.capitalize())  #на початку речення символ капсом

print(result.isupper())     #false якщо не всі символи капсом or true якщо всі символи капсом 

print(result.islower())     #false якщо не всі символи з малої or true якщо всі символи з малої 

print("\n\n\n\n\n\n\n\n")

text = 'football,basketball,skate'
hobbies = text.split(',')       #якщо я хочу розбити текст який у text по якомусь символі в цьому випадку по комі

for i in range(0, len(hobbies)):
    hobbies [i] = hobbies[i].capitalize()
print(hobbies)


res = ",".join(hobbies)

print(res)
print('\n\n\n\n\n')
#індекси і зрізи

lis = [2, 4 ,6, True, 'Some ']
print(lis[0:3])         #з 0 комірки по індексу до 3 НОМЕРУ не по індексу а до 3 НОМЕРА вивебеться 2, 4, 6  ??

print(lis[2:])          #почне виводити з 2 комірки до кінця масиву         ?

print(lis[2:-1])        #почне виводити все з 2 комірки до кінця окрім останнього бо -1     ?

print(lis[:-2])        #почне виводити все окрім останніх двух бо -2 може бути -1 і тд тп       ?

print(lis[:2])          #це означає що я буду виводити тільки до дургого елементу тобто до '4'      ?

print(lis[0::2])        #це рзначає що я перебираю все елементи але через 2 топу по дефолту стоїть 1 а я по 2 зразу перебираю       ?

print(lis[::-1])       #це означає що тепер елементи у зворотньому порядку може бути і -2 тобто в зворотньому порядку через 2       ?

print(lis[:-4:-1])     #якщо я вже перебираю зворотньо тобто відємне то вже в інших значеннях теж краще писати з -      ?


