#кортежи - це типу як масив але не можливо його переписати протягом програми  (не модемо міняти значення елементів)

data = (2, 4, True, 66, [44, 676], (3, 6))

print(data)

print(data[3])       #якщо хочеш звернутися до якогось індексу в кортежі дії такі ж самі як і з масивом

#data[0] = 0         #помилка, такого бути не може його не можливо переписати бо це кортеж

#функції такі ж самі як і до масиву але ми не можемо нічого видаляти або додавати

info = 2, 3, 4, 5       # так теж можна створювати кортеж
